'''
#출력문
print(출력할 내용)
print(내용1, 내용2, 내용3, etc)
'''

# 숫자 출력 print(숫자)
print(401) # 정수 출력
print(36.5) # 실수 출력
print() #공백 추가

#문자열 출력 print('문자열')
print('401호 강의실')
print("401호 강의실")
print('#401호')
print()

# 여러개의 문자열 출력
print('2024년', '청룡의', '해') #콤마(,)로 이어붙이면 공백 포함
print('2024년'+'청룡의'+'해') #덧셈기호(+)로 이어붙이면 공백x
print('2024년''청룡의''해')
print()
# 여러 데이터 타입을 혼합하여 출력
print(1,'더하기',2,'는', 1+2)
# print(401+'호 강의실') 숫자랑 문자열은 덧셈기호로 이어붙일 수 없다.
print(401,'호 강의실', sep='') #콤마로 이어붙이되 공백 포함하고 싶지 않을 때 sep=''

print()


#여러줄 텍스트 문자열 출력: 외따옴표 또는 쌍따옴표 세쌍
print('''여러줄 텍스트는
여러줄의 문자열 내용을
한줄씩 띄어서 출력
''')

