'''
# if-else 조건문
조건식의 결과에 따라서 실행내용을 선택하여 수행
        if 조건식:
            (if조건식이 참이면 실행)
            실행문1
            실행문2
            ...
        else:
            (if조건식이 거짓이면 실행)
            실행문3
            실행문4
            ...
'''

n = 10
if n >=50:
    print('50보다 크거나 같습니다.')
else: #위 범위의 반대방향 #if n < 50:
    print('50보다 작습니다.')

#어떤 수가 3의 배수인지 아닌지 확인하기
a = 15
if a%3 == 0: #어떤 수를 3으로 나누었을떄 나머지가 0이면 3의 배수
    print('3의 배수입니다')
else:
    print('3의 배수가 아닙니다.')


#practice
score = float(input('점수를 입력하세요:'))
if score>=70:
    print('합격')
else:
    print('불합격')

