'''
# 관계연산자(비교연산자)
>,<=,<,>=, ==, !=
두 값을 비교한 결과를 참 또는 거짓으로 제공

==: 서로 같은가? (물어보는것임)
!=: 서로 다른가?

a == b : a와 b가 같으면 True, 다르면 False
a != b : a와 b가 다르면 True, 다르면 False
'''

a = 10 >5
b = 11 <= 10
print('a=', a, type(a))
print('b=', b)
##################################################

num1=10 #내용이 수직으로 길어질 경우, 세미콜론(;)으로 구별지어서 한 줄로 길게 쓸 수도
num2=20
num3=30
#'=='연산자는 서로 값이 같은지 확인
c = num1==num3
print('c=',c)

d = num1+num2 ==3
print('d=', d)

#'!=' 연산자는 서로 값이 달라야 참
e = num1!=num3
f = (num1+num2)!=num3
print('e=', e)
print('f=',f)

# 관계연산자는 동시에 여러개 사용 가능
print(num3>num2>num1)
print(num2>num1>num3)

