'''
# 사칙 연산자
+: 덧셈
-: 뺄셈
*: 곱셈

/: 나눗셈 연산자 - 결과는 실수형 (소수자리 포함)
%: 나머지 연산자

//: 정수 나누기 연산자 - 나누기 후 소수점 이하를 버림. , 정수타입으로 출력한다는 소리는 아님.
**: 제곱 연산자

'''
print(10+20.5)
print(50-30)
print(10*50)
print()
print(10%3)
print(11%3)
print(11%3.5)
print()
print(3//2)
print(4**3)
print()

print(5/4)
print(4/2)
print(4//2)

# 문자열과 숫자에서 '+', '*'기호
print('토요일'+'일요일') #문자열+문자열: 이어붙임
print('일욜'*3) # 문자열*숫자: 숫자만큼 문자열을 생성
# print(402+'호') # 문자열 + 숫자: x
print(True+10) #True = 1 / False = 0